kayrozen/Pajoniiir/firmware/main-deck-jc1060/sdkconfig.defaults
# SDK Configuration defaults for JC1060P470C target

# Target ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# Pre-v3 ESP32-P4 silicon support (production board)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100

# PSRAM configuration (16MB HEX mode)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SIZE_OVERRIDE=16

# LCD/DPI configuration
CONFIG_LCD_PANEL_IO_FORMAT_BUF_SIZE=32
CONFIG_LCD_RGB_EDK_SUPPORT=y

# LVGL configuration
CONFIG_LVGL_VERSION_8=y
CONFIG_LVGL_COLOR_DEPTH_16=y
CONFIG_LVGL_MEM_CUSTOM=y
CONFIG_LVGL_MEM_CUSTOM_ALLOC="heap_caps_malloc"
CONFIG_LVGL_MEM_CUSTOM_FREE="heap_caps_free"
CONFIG_LVGL_DISP_DEF_REFR_PERIOD=30
CONFIG_LVGL_DPI=130

# I2C configuration
CONFIG_I2C_ENABLE=y
CONFIG_I2C_ISR_IRAM_SAFE=y

# I2S configuration
CONFIG_I2S_ENABLE=y
CONFIG_I2S_ISR_IRAM_SAFE=y

# USB Host configuration
CONFIG_USB_HOST_ENABLE=y

# SDMMC configuration
CONFIG_SDMMC_TRANS_SPEED_LIMIT=0
CONFIG_SDMMC_USING_DMA=y

# Heap tracing for debugging
CONFIG_HEAP_TRACING=y

# Log levels
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
